/** @type {Translation} */
export default {
    fetchErrors: {
        notFoundCityInCountry: (country) =>
            `Вибачте, міста в країні ${country} не знайдено. Будь ласка, спробуйте ще раз.`,
        invalidPositionValue: `Недопустиме значення позиції.`,
        listing: `Щось пішло не так, будь ласка, спробуйте пізніше. Вибачте.`,
        noMoreListing: `Вибачте, більше немає доступних оголошень за вашим запитом.`,
        noSearchRequest: `Я не знаю, які об'єкти я можу вам показати, вам потрібно спочатку зробити запит на пошук.`,
        seller: `Вибачте, я не можу отримати інформацію про продавця.`,
    },
    buttons: {
        clearFilters: `Очистити фільтри`,
        currentFilters: `Показати фільтри`,
        openInBrowser: `Відкрити в браузері`,
        sellerContacts: `Контакти продавця`,
        showDetails: `Показати деталі`,
        showMore: `Показати більше`,
        showOnMap: `Показати на карті`,
        continueSearch: `Продовжити пошук`,
    },
    info: {
        about: `Якщо ви хочете дізнатися, які фільтри можна використовувати для пошуку найкращого варіанту для вас, просто скажіть \*Інформація\*`,
        noMoreResultsReset: `Більше немає результатів, скажіть "\*Скидання\*" для очищення фільтрів.`,
        noMoreResultsResetCommand: `Більше немає результатів, ви можете очистити фільтри командою **Скидання**`,
        showMoreResults: `Щоб побачити більше результатів, просто скажіть \*Показати більше\*`,
        showMoreResultsAndReset: `Щоб побачити більше результатів, скажіть "\*Показати більше\*". Щоб очистити фільтри, скажіть "\*Скидання\*"`,
        language: `English language, русский язык, українська мова, ελληνική γλώσσα, język polski`,
        continueSearch: `Щоб продовжити пошук, скажіть \*Продовжити пошук\*`,
    },
    help: [
        "Щоб змінити мову, напишіть мову, на якій ви хочете, щоб бот з вами спілкувався. Наприклад, 'Переключитися на польську'",
        "Бот може говорити 5 мовами: \n - Англійська \n - Грецька \n - Російська \n - Українська \n - Польська",
        "Щоб почати пошук, вам потрібно вказати місцезнаходження, тип нерухомості (будинок, вілла, квартира, комерційна нерухомість, земля), тип оголошення (оренда або покупка) та бюджет. Наприклад, *Я хочу купити будинок у Лімассолі, мій бюджет понад 100 тисяч євро*",
        "Ось список зручностей, які ви можете ввести: \n" +
        "- Тип нерухомості *(Квартира, Вілла, Окремий будинок, Напівтериторіальний будинок, Офіс, Готель, Виробництво, Торгове приміщення, Ресторан, Склад, Парковка, Магазин, Ресторан, Інша комерційна нерухомість, Комерційна земля, Житлова земля, Сільськогосподарська земля)* _Хочу квартиру_\n" +
        "- Тип оголошення *(Оренда, Короткострокова оренда, Продаж)* _Цікавить покупка_\n" +
        "- Ціна\n" +
        "- Меблювання *(Без, Частково, Повністю)* _Частково мебльовано_\n" +
        "- Статус нерухомості *(Нове, Перепродаж)* _Нова нерухомість_\n" +
        "- Стан *(Нове, Добре збережене, Потрібен ремонт)* _Добре збережене_\n" +
        "- Охоронна сигналізація\n" +
        "- Кондиціонер *(Повсюдно, Лише в спальнях, Немає)* _Без кондиціонера_\n" +
        "- Опалення *(Немає, Центральне, Газове, Електричне, Рідке паливо)* _Газове опалення_\n" +
        "- Водонагрівач *(Немає, Центральне, Бойлер, Сонячна система, Фотоелектрична система)\n" +
        "- Балкон\n" +
        "- Рік побудови\n" +
        "- Стан будівлі *(Готове до заселення, На стадії будівництва)\n" +
        "- Стан *(Нове, Добре доглянуте, Потрібен ремонт)\n" +
        "- Кухня\n" +
        "- Парковка\n" +
        "- Площа\n" +
        "- Кількість кімнат\n" +
        "- Кількість ванних кімнат\n" +
        "- Дозволено проживання з домашніми тваринами\n" +
        "- Електрика\n" +
        "- Інтернет *(Немає, Wi-Fi, Кабельний, Мобільний)\n" +
        "- Особливості розташування *(Біля озера, Біля моря, Біля схилу, Біля школи, Чудовий вид, Біля аеропорту, Біля річки, Біля лісу, Біля гір, Біля дитячого садка, Біля метро, Біля парку, Центр міста, Вид на море, Тихий район, Престижний район, Біля супермаркету)* _Біля моря_\n" +
        "- Інфраструктурні зручності *(Охорона, Окремий вхід, Зона для барбекю, Гольф, Підземна парковка, Тенісний корт, Дитячий майданчик, Відеоспостереження, Тренажерний зал, Ліфт, Закритий басейн, Рецепція, Огороджений вхід, Тепла підлога, Тераса, Усталенний дизайн, Сонячні панелі, Теплоізоляція, Підвал, Дах-терраса, Сад, Гараж, Земельна ділянка, Склад, Сауна)* _Біля тренажерного залу_\n" +
        "- Зручності ремонту *(Великий балкон, Сучасний дизайн, Велика кухня, Панорамні вікна, Ванна кімната з ванною, Сонячний водонагрівач, Ламінат у всіх спальнях)* _Сучасний дизайн_\n" +
        "- Додаткові зручності *(Найкраща ціна, За домовленістю, Без ПДВ, Документи на право власності)* _Показати найкращу ціну_",
        "Щоб отримати більш детальну інформацію про конкретну нерухомість, введіть '*показати по* _id нерухомості_'. Ви також можете використовувати команди '*деталі для* _першого|останнього_ *оголошення*' після відображення списку.",
        "Якщо ви хочете перезапустити розмову та очистити всю попередню інформацію, просто скажіть *Скинути*",
    ],
    hello: [
        `Здравствуйте! Я ваш помічник по нерухомості. Ви хочете орендувати чи купити нерухомість?`,
        `Привіт! Я тут, щоб допомогти вам знайти ідеальний дім. Ви плануєте орендувати чи купити?`,
        `Добрий день! Я готовий допомогти вам з вибором нерухомості. Вас цікавить оренда чи покупка?`,
        `Вітаю! Шукаєте нову квартиру? Скажіть, що вам потрібно, і я допоможу вам знайти найкращий варіант.`,
        `Здравствуйте! Я ваш ІІ-помічник по нерухомості. Як я можу вам допомогти — оренда чи покупка?`,
    ],
    bye: [
        "Дякую, що звернулися до мене! Удачі в пошуку житла!",
        "Усього найкращого! Якщо у вас є ще питання, не соромтеся запитувати.",
        "Сподіваюся, я зміг вам допомогти. Гарного дня!",
        "До побачення! Удачі з орендою чи покупкою нової квартири!",
        "Дякую за ваш час! Якщо вам потрібна додаткова допомога, я завжди тут.",
        "До зустрічі! Удачі в пошуку житла!",
        "Радий був допомогти! Усього найкращого в пошуку квартири.",
        "Прощайте! Сподіваюся, ви скоро знайдете свій ідеальний дім.",
        "Дякую, що звернулися! Якщо у вас будуть ще питання, я тут, щоб допомогти.",
        "Усього найкращого! Нехай ваш пошук нерухомості буде успішним.",
    ],
    noMatch: [
        "Вибачте, я не зрозумів вашу команду. Чи могли б ви уточнити, що саме ви хочете дізнатися або зробити? Наприклад, ви шукаєте інформацію про нерухомість чи у вас інший запит?",
        "Вибачте, але я не розпізнав цю команду. Чи могли б ви детальніше пояснити, що ви намагалися зробити? Наприклад, ви хочете знайти квартиру для оренди чи купівлі, чи у вас є інші питання по нерухомості?",
        "Я не зрозумів вашу команду. Чи могли б ви уточнити ваш запит? Наприклад, ви шукаєте інформацію про ринок нерухомості чи у вас є конкретні вимоги до житла?",
    ],
    getProperty: {
        area: `Який периметр вас цікавить?`,
        bedrooms: `Скільки спалень вам потрібно?`,
        budget: `Який у вас бюджет?`,
        coverageRatio: `Які переваги щодо коефіцієнта забудови?`,
        country: `Would you like to check all the option in this country?`,
        density: `Яка щільність забудови вам потрібна?`,
        floorNumber: `На яких поверхах ви хочете знайти приміщення?`,
        id: `Будь ласка, вкажіть ID об'єкта нерухомості.`,
        listingType: `Який тип володіння нерухомістю вас цікавить: купівля чи оренда?`,
        location: `У якому місті ви хочете подивитися нерухомість?`,
        propertyType: `Який тип нерухомості вас цікавить: квартира, будинок, вілла, комерція, ділянка?`,
        residentialFloors: `На яких поверхах повинні розташовуватися житлові поверхи?`,
        language: `Яку мову інтерфейсу ви хочете вибрати?`,
    },
    general: {
        filters: "Застосовані фільтри під час пошуку",
    },
    seller: {
        phone: "Номер телефону",
        email: "Електронна пошта",
        site: "Сайт",
    },
    property: {
        airConditioning: {
            value: "Кондиціонер",
            NO: "Ні",
            EVERYWHERE: "Скрізь",
            ONLY_BEDROOMS: "Тільки у спальнях",
            PROVISION: "Підведення",
            YES: "Так",
        },
        alarmSystem: `Охоронна сигналізація`,
        area: `Площа об'єкта`,
        balcony: `Балкон`,
        bathrooms: `Ванні кімнати`,
        bedrooms: `Спальні`,
        buildigConditions: {
            value: `Стан будівлі`,
            READY_TO_MOVE_IN: `Готово до заселення`,
            UNDER_CONSTRUCTION: `На стадії будівництва`,
            NEEDS_RENOVATION: `Потребує ремонту`,
            RENOVATED: `Відремонтовано`,
        },
        coverageRatio: `Коефіцієнт забудови`,
        density: `Щільність забудови`,
        electricity: `Електрика`,
        floorArea: `Площа поверху`,
        furnishing: {
            value: "Меблювання",
            NO: "Ні",
            PARTLY: "Частково",
            FULLY: "Повністю",
            YES: "Так",
        },
        gas: `Газ`,
        heating: {
            value: "Опалення",
            NO: "Ні",
            CENTRAL: "Центральне",
            GAS: "Газове",
            ELECTRIC: "Електричне",
            LIQUID_FUEL: "Рідке паливо",
            YES: "Так",
        },
        infrastructureAmenities: {
            value: "Інфраструктурні зручності",
            SECURITY: "Охорона",
            SEPARATE_ENTRANCE: "Окремий вхід",
            BBQ_AREA: "Зона барбекю",
            GOLF: "Гольф",
            UNDERGROUND_PARKING: "Підземний паркінг",
            TENNIS_COURT: "Тенісний корт",
            PLAYGROUND: "Дитячий майданчик",
            CCTV: "Відеоспостереження",
            GYM: "Тренажерний зал",
            ELEVATOR: "Ліфт",
            INDOOR_POOL: "Критий басейн",
            RECEPTION: "Рецепція",
            GATED_ENTRANCE: "Закритий в'їзд",
            UNDERFLOOR_HEATING: "Підігрів підлоги",
            TERRACE: "Тераса",
            SUSTAINABLE_DESIGN: "Стійкий дизайн",
            PHOTOVOLTAIC_PROVISIONS: "Фотовольтаїчні установки",
            THERMAL_INSULATION: "Теплоізоляція",
            WITH_BASEMENT: "З підвалом",
            ROOF_TERRACE: "Тераса на даху",
            WITH_GARDEN: "З садом",
            WITH_GARAGE: "З гаражем",
            WITH_PLOT: "З ділянкою",
            STORAGE: "Сховище",
            SAUNA: "Сауна",
        },
        internet: {
            value: "Інтернет",
            NO: "Ні",
            WIFI: "Wi-Fi",
            CABLE: "Кабельний",
            MOBILE: "Мобільний",
            YES: "Так",
        },
        kitchen: `Кухня`,
        parking: `Парковка`,
        repairAmenities: {
            value: "Особливості ремонту",
            BIG_BALCONY: "Великий балкон",
            MODERN_DESIGN: "Сучасний дизайн",
            BIG_KITCHEN: "Велика кухня",
            PANORAMIC_WINDOWS: "Панорамні вікна",
            EN_SUITE_BATHROOM: "Ванна кімната з власною ванною",
            SOLAR_POWERED_WATER_BOILER: "Водонагрівач на сонячних батареях",
            LAMINATED_FLOORS_IN_ALL_BEDROOMS: "Ламінат у всіх спальнях",
        },
        residentialFloors: `Житлові поверхи`,
        sewageSystem: `Каналізація`,
        television: `Телебачення`,
        water: `Вода`,
        waterHeating: {
            value: "Нагрів води",
            NO: "Ні",
            CENTRAL: "Центральний",
            BOILER: "Бойлер",
            COMBINE: "Комбінований",
            SOLAR_SYSTEM: "Сонячна система",
            PHOTOVOLTAIC_SYSTEM: "Фотоелектрична система",
        },
        location: `Локація`,
        locationFeatures: {
            value: "Особливості розташування",
            NEAR_THE_LAKE: "Біля озера",
            NEAR_THE_SEA: "Біля моря",
            NEAR_THE_SLOPE: "Біля схилу",
            NEAR_THE_SCHOOL: "Біля школи",
            BEAUTIFUL_VIEW: "Прекрасний вид",
            NEAR_THE_AIRPORT: "Біля аеропорту",
            NEAR_THE_RIVER: "Біля річки",
            NEAR_THE_FOREST: "Біля лісу",
            NEAR_THE_MOUNTAINS: "Біля гір",
            NEAR_THE_KINDERGARTEN: "Біля дитячого садка",
            NEAR_THE_SUBWAY: "Біля метро",
            NEAR_THE_PARK: "Біля парку",
            CITY_CENTER: "Центр міста",
            SEA_VIEW: "Вид на море",
            CALM_DISTRICT: "Спокійний район",
            PRESTIGIOUS_DISTRICT: "Престижний район",
            NEAR_THE_SUPERMARKET: "Біля супермаркету",
        },
        swimmingPool: "Басейн",
        price: {
            value: `Ціна`,
            budget: `Бюджет`,
        },
        listingType: {
            value: `Тип володіння`,
            RENT: `Оренда`,
            SHORT_RENT: `Короткострокова оренда`,
            SALE: `Продаж`,
        },
        propertyType: {
            value: "Тип нерухомості",
            APARTMENT: `Квартира`,
            VILLA: `Вілла`,
            DETACHED_HOUSE: `Окремий будинок`,
            SEMIDETACHED_HOUSE: `Дуплекс`,
            OFFICE: `Офіс`,
            HOTEL: `Готель`,
            MANUFACTURING: `Виробництво`,
            RETAIL_SPACE: `Торгове приміщення`,
            PUBLIC_CATERING_FACILITY: `Громадське харчування`,
            WAREHOUSE: `Склад`,
            CAR_PARKING: `Парковка`,
            SHOP: `Магазин`,
            RESTAURANT: `Ресторан`,
            OTHER_COMMERCIAL: `Інше комерційне`,
            COMMERCIAL_PLOT: `Комерційна ділянка`,
            RESIDENTIAL_PLOT: `Житлова ділянка`,
            AGRICULTURE_PLOT: `Сільськогосподарська ділянка`,
        },
    },
};
