/** @type {Translation} */
export default {
    fetchErrors: {
        notFoundCityInCountry: (country) =>
            `Вибачте, міста в країні ${country} не знайдено. Будь ласка, спробуйте ще раз.`,
        invalidPositionValue: `Недопустиме значення позиції.`,
        listing: `Щось пішло не так, будь ласка, спробуйте пізніше. Вибачте.`,
        noMoreListing: `Вибачте, більше немає доступних оголошень за вашим запитом.`,
        noSearchRequest: `Я не знаю, які об'єкти я можу вам показати, вам потрібно спочатку зробити запит на пошук.`,
        seller: `Вибачте, я не можу отримати інформацію про продавця.`,
    },
    buttons: {
        clearFilters: `Очистити фільтри`,
        currentFilters: `Показати фільтри`,
        openInBrowser: `Відкрити в браузері`,
        sellerContacts: `Контакти продавця`,
        showDetails: `Показати деталі`,
        showMore: `Показати більше`,
        showOnMap: `Показати на карті`,
        continueSearch: `Продовжити пошук`,
    },
    info: {
        about: `Якщо ви хочете дізнатися, які фільтри можна використовувати для пошуку найкращого варіанту для вас, просто скажіть \*Інформація\*`,
        noMoreResultsReset: `Більше немає результатів, скажіть "\*Скидання\*" для очищення фільтрів.`,
        noMoreResultsResetCommand: `Більше немає результатів, ви можете очистити фільтри командою **Скидання**`,
        showMoreResults: `Щоб побачити більше результатів, просто скажіть \*Показати більше\*`,
        showMoreResultsAndReset: `Щоб побачити більше результатів, скажіть "\*Показати більше\*". Щоб очистити фільтри, скажіть "\*Скидання\*"`,
        language: `English language, русский язык, українська мова, ελληνική γλώσσα, język polski`,
        continueSearch: `Щоб продовжити пошук, скажіть \*Продовжити пошук\*`,
    },
    help: [
        "Щоб змінити мову, вкажіть мову, якою ви хочете, щоб бот взаємодіяв із вами. Наприклад, Переключитися на польську.",
        "Бот може говорити 5 мовами: \n - Англійська \n - Грецька \n - Російська \n - Українська \n - Польська",
        "Щоб розпочати пошук, вам потрібно вказати місцезнаходження, тип нерухомості (будинок, вілла, квартира, комерційна нерухомість, ділянка), тип оголошення (оренда чи купівля) та бюджет. Наприклад, *Я хочу купити будинок у Лімасолі, мій бюджет понад 100 тисяч євро*",
        "Ось список фільтрів, які ви можете ввести: \n" +
            `🔘 *Тип нерухомості* \nКвартира, Вілла, Окремий будинок, Суміжний будинок, Офіс, Готель, Виробництво, Торгове приміщення, Заклад харчування, Склад, Парковка, Магазин, Ресторан, Інша комерційна нерухомість, Комерційна ділянка, Житлова ділянка, Сільськогосподарська ділянка \n💬 _"Шукаю квартиру"_\n\n` +
            `🔘 *Тип оголошення* \nОренда, Короткострокова оренда, Продаж \n💬 _"Хочу купити"_\n\n` +
            `🔘 *Ціна* \n💬 _"Бюджет від 150к до 200к євро"_\n\n` +
            `🔘 *Меблювання* \nБез, Частково, Повністю \n💬 _"Частково мебльована"_\n\n` +
            `🔘 *Статус нерухомості* \nНова, Перепродаж \n💬 _"Нова нерухомість"_\n\n` +
            `🔘 *Стан* \nНове, У гарному стані, Потребує ремонту \n💬 _"У гарному стані"_\n\n` +
            `🔘 *Система охоронної сигналізації* \n💬 _"З охоронною сигналізацією"_\n\n` +
            `🔘 *Кондиціонер* \nСкрізь, Лише у спальнях, Немає \n💬 _"Без кондиціонера"_\n\n` +
            `🔘 *Опалення* \nНемає, Центральне, Газове, Електричне, Рідке паливо \n💬 _"З газовим опаленням"_\n\n` +
            `🔘 *Водонагрів* \nНемає, Центральний, Бойлер, Сонячна система, Фотоелектрична система \n💬 _"З центральним водопостачанням"_\n\n` +
            `🔘 *Балкон* \n💬 _"З балконом"_\n\n` +
            `🔘 *Рік побудови* \n💬 _"2024 року побудови"_\n\n` +
            `🔘 *Стан будівлі* \nГотове до заселення, У процесі будівництва \n💬 _"Будівля ще будується"_\n\n` +
            `🔘 *Стан* \nНове, Доглянуте, Потребує ремонту \n💬 _"Доглянута квартира"_\n\n` +
            `🔘 *Кухня* \n💬 _"З кухнею"_\n\n` +
            `🔘 *Парковка* \n💬 _"З парковкою"_\n\n` +
            `🔘 *Площа* \n💬 _"90 квадратних метрів"_\n\n` +
            `🔘 *Кількість кімнат* \n💬 _"2-3 кімнати"_\n\n` +
            `🔘 *Кількість ванних кімнат* \n💬 _"Дві ванні кімнати"_\n\n` +
            `🔘 *Проживання з домашніми тваринами* \n💬 _"Можна жити з тваринами"_\n\n` +
            `🔘 *Електрика* \n💬 _"З підключеною електрикою"_\n\n` +
            `🔘 *Інтернет* \nНемає, Wi-Fi, Кабельний, Мобільний \n💬 _"Потрібен кабельний інтернет"_\n\n` +
            `🔘 *Особливості розташування* \nПоруч з озером, Поруч з морем, Поруч зі схилом, Поруч зі школою, Чудовий вид, Поруч з аеропортом, Поруч з річкою, Поруч з лісом, Поруч з горами, Поруч з дитячим садком, Поруч з метро, Поруч з парком, Центр міста, Вид на море, Тихий район, Престижний район, Поруч з супермаркетом \n💬 _"Поруч з морем"_\n\n` +
            `🔘 *Інфраструктурні зручності* \nОхорона, Окремий вхід, Зона для барбекю, Гольф, Підземна парковка, Тенісний корт, Дитячий майданчик, Відеоспостереження, Тренажерний зал, Ліфт, Закритий басейн, Рецепція, Огорожа, Тепла підлога, Тераса, Стійкий дизайн, Сонячні панелі, Теплоізоляція, Підвал, Тераса на даху, Сад, Гараж, Ділянка, Склад, Сауна \n💬 _"Поруч з тренажерним залом"_\n\n` +
            `🔘 *Ремонтні зручності* \nВеликий балкон, Сучасний дизайн, Велика кухня, Панорамні вікна, Ванна кімната з ванною, Сонячний водонагрівач, Ламінат у спальнях \n💬 _"З сучасним дизайном"_ \n\n` +
            `🔘 *Додаткові зручності* \nНайкраща ціна, Договірна, Без ПДВ, Документи на право власності \n💬 _"Показати з найкращою ціною"_\n\n`,
        `Щоб отримати більше деталей про конкретну нерухомість, введіть "*показати за* _ID нерухомості_". Ви також можете скористатися командами "*деталі для* _першого|останнього_ *оголошення*" після відображення списку.`,
        `Якщо ви хочете перезапустити розмову та очистити всю попередню інформацію, просто скажіть *Скинути*`,
    ],
    hello: [
        `Здравствуйте! Я ваш помічник по нерухомості. Ви хочете орендувати чи купити нерухомість?`,
        `Привіт! Я тут, щоб допомогти вам знайти ідеальний дім. Ви плануєте орендувати чи купити?`,
        `Добрий день! Я готовий допомогти вам з вибором нерухомості. Вас цікавить оренда чи покупка?`,
        `Вітаю! Шукаєте нову квартиру? Скажіть, що вам потрібно, і я допоможу вам знайти найкращий варіант.`,
        `Здравствуйте! Я ваш ІІ-помічник по нерухомості. Як я можу вам допомогти — оренда чи покупка?`,
    ],
    bye: [
        "Дякую, що звернулися до мене! Удачі в пошуку житла!",
        "Усього найкращого! Якщо у вас є ще питання, не соромтеся запитувати.",
        "Сподіваюся, я зміг вам допомогти. Гарного дня!",
        "До побачення! Удачі з орендою чи покупкою нової квартири!",
        "Дякую за ваш час! Якщо вам потрібна додаткова допомога, я завжди тут.",
        "До зустрічі! Удачі в пошуку житла!",
        "Радий був допомогти! Усього найкращого в пошуку квартири.",
        "Прощайте! Сподіваюся, ви скоро знайдете свій ідеальний дім.",
        "Дякую, що звернулися! Якщо у вас будуть ще питання, я тут, щоб допомогти.",
        "Усього найкращого! Нехай ваш пошук нерухомості буде успішним.",
    ],
    noMatch: [
        "Вибачте, я не зрозумів вашу команду. Чи могли б ви уточнити, що саме ви хочете дізнатися або зробити? Наприклад, ви шукаєте інформацію про нерухомість чи у вас інший запит?",
        "Вибачте, але я не розпізнав цю команду. Чи могли б ви детальніше пояснити, що ви намагалися зробити? Наприклад, ви хочете знайти квартиру для оренди чи купівлі, чи у вас є інші питання по нерухомості?",
        "Я не зрозумів вашу команду. Чи могли б ви уточнити ваш запит? Наприклад, ви шукаєте інформацію про ринок нерухомості чи у вас є конкретні вимоги до житла?",
    ],
    getProperty: {
        area: `Який периметр вас цікавить?`,
        bedrooms: `Скільки спалень вам потрібно?`,
        budget: `Який у вас бюджет?`,
        coverageRatio: `Які переваги щодо коефіцієнта забудови?`,
        country: `Would you like to check all the option in this country?`,
        density: `Яка щільність забудови вам потрібна?`,
        floorNumber: `На яких поверхах ви хочете знайти приміщення?`,
        id: `Будь ласка, вкажіть ID об'єкта нерухомості.`,
        listingType: `Який тип володіння нерухомістю вас цікавить: купівля чи оренда?`,
        location: `У якому місті ви хочете подивитися нерухомість?`,
        propertyType: `Який тип нерухомості вас цікавить: квартира, будинок, вілла, комерція, ділянка?`,
        residentialFloors: `На яких поверхах повинні розташовуватися житлові поверхи?`,
        language: `Яку мову інтерфейсу ви хочете вибрати?`,
    },
    general: {
        filters: "Застосовані фільтри під час пошуку",
    },
    seller: {
        phone: "Номер телефону",
        email: "Електронна пошта",
        site: "Сайт",
    },
    property: {
        airConditioning: {
            value: "Кондиціонер",
            NO: "Ні",
            EVERYWHERE: "Скрізь",
            ONLY_BEDROOMS: "Тільки у спальнях",
            PROVISION: "Підведення",
            YES: "Так",
        },
        alarmSystem: `Охоронна сигналізація`,
        area: `Площа об'єкта`,
        balcony: `Балкон`,
        bathrooms: `Ванні кімнати`,
        bedrooms: `Спальні`,
        buildigConditions: {
            value: `Стан будівлі`,
            READY_TO_MOVE_IN: `Готово до заселення`,
            UNDER_CONSTRUCTION: `На стадії будівництва`,
            NEEDS_RENOVATION: `Потребує ремонту`,
            RENOVATED: `Відремонтовано`,
        },
        coverageRatio: `Коефіцієнт забудови`,
        density: `Щільність забудови`,
        electricity: `Електрика`,
        floorArea: `Площа поверху`,
        furnishing: {
            value: "Меблювання",
            NO: "Ні",
            PARTLY: "Частково",
            FULLY: "Повністю",
            YES: "Так",
        },
        gas: `Газ`,
        heating: {
            value: "Опалення",
            NO: "Ні",
            CENTRAL: "Центральне",
            GAS: "Газове",
            ELECTRIC: "Електричне",
            LIQUID_FUEL: "Рідке паливо",
            YES: "Так",
        },
        infrastructureAmenities: {
            value: "Інфраструктурні зручності",
            SECURITY: "Охорона",
            SEPARATE_ENTRANCE: "Окремий вхід",
            BBQ_AREA: "Зона барбекю",
            GOLF: "Гольф",
            UNDERGROUND_PARKING: "Підземний паркінг",
            TENNIS_COURT: "Тенісний корт",
            PLAYGROUND: "Дитячий майданчик",
            CCTV: "Відеоспостереження",
            GYM: "Тренажерний зал",
            ELEVATOR: "Ліфт",
            INDOOR_POOL: "Критий басейн",
            RECEPTION: "Рецепція",
            GATED_ENTRANCE: "Закритий в'їзд",
            UNDERFLOOR_HEATING: "Підігрів підлоги",
            TERRACE: "Тераса",
            SUSTAINABLE_DESIGN: "Стійкий дизайн",
            PHOTOVOLTAIC_PROVISIONS: "Фотовольтаїчні установки",
            THERMAL_INSULATION: "Теплоізоляція",
            WITH_BASEMENT: "З підвалом",
            ROOF_TERRACE: "Тераса на даху",
            WITH_GARDEN: "З садом",
            WITH_GARAGE: "З гаражем",
            WITH_PLOT: "З ділянкою",
            STORAGE: "Сховище",
            SAUNA: "Сауна",
        },
        internet: {
            value: "Інтернет",
            NO: "Ні",
            WIFI: "Wi-Fi",
            CABLE: "Кабельний",
            MOBILE: "Мобільний",
            YES: "Так",
        },
        kitchen: `Кухня`,
        parking: `Парковка`,
        repairAmenities: {
            value: "Особливості ремонту",
            BIG_BALCONY: "Великий балкон",
            MODERN_DESIGN: "Сучасний дизайн",
            BIG_KITCHEN: "Велика кухня",
            PANORAMIC_WINDOWS: "Панорамні вікна",
            EN_SUITE_BATHROOM: "Ванна кімната з власною ванною",
            SOLAR_POWERED_WATER_BOILER: "Водонагрівач на сонячних батареях",
            LAMINATED_FLOORS_IN_ALL_BEDROOMS: "Ламінат у всіх спальнях",
        },
        residentialFloors: `Житлові поверхи`,
        sewageSystem: `Каналізація`,
        television: `Телебачення`,
        water: `Вода`,
        waterHeating: {
            value: "Нагрів води",
            NO: "Ні",
            CENTRAL: "Центральний",
            BOILER: "Бойлер",
            COMBINE: "Комбінований",
            SOLAR_SYSTEM: "Сонячна система",
            PHOTOVOLTAIC_SYSTEM: "Фотоелектрична система",
        },
        location: `Локація`,
        locationFeatures: {
            value: "Особливості розташування",
            NEAR_THE_LAKE: "Біля озера",
            NEAR_THE_SEA: "Біля моря",
            NEAR_THE_SLOPE: "Біля схилу",
            NEAR_THE_SCHOOL: "Біля школи",
            BEAUTIFUL_VIEW: "Прекрасний вид",
            NEAR_THE_AIRPORT: "Біля аеропорту",
            NEAR_THE_RIVER: "Біля річки",
            NEAR_THE_FOREST: "Біля лісу",
            NEAR_THE_MOUNTAINS: "Біля гір",
            NEAR_THE_KINDERGARTEN: "Біля дитячого садка",
            NEAR_THE_SUBWAY: "Біля метро",
            NEAR_THE_PARK: "Біля парку",
            CITY_CENTER: "Центр міста",
            SEA_VIEW: "Вид на море",
            CALM_DISTRICT: "Спокійний район",
            PRESTIGIOUS_DISTRICT: "Престижний район",
            NEAR_THE_SUPERMARKET: "Біля супермаркету",
        },
        swimmingPool: "Басейн",
        price: {
            value: `Ціна`,
            budget: `Бюджет`,
        },
        listingType: {
            value: `Тип володіння`,
            RENT: `Оренда`,
            SHORT_RENT: `Короткострокова оренда`,
            SALE: `Продаж`,
        },
        propertyType: {
            value: "Тип нерухомості",
            APARTMENT: `Квартира`,
            VILLA: `Вілла`,
            DETACHED_HOUSE: `Окремий будинок`,
            SEMIDETACHED_HOUSE: `Дуплекс`,
            OFFICE: `Офіс`,
            HOTEL: `Готель`,
            MANUFACTURING: `Виробництво`,
            RETAIL_SPACE: `Торгове приміщення`,
            PUBLIC_CATERING_FACILITY: `Громадське харчування`,
            WAREHOUSE: `Склад`,
            CAR_PARKING: `Парковка`,
            SHOP: `Магазин`,
            RESTAURANT: `Ресторан`,
            OTHER_COMMERCIAL: `Інше комерційне`,
            COMMERCIAL_PLOT: `Комерційна ділянка`,
            RESIDENTIAL_PLOT: `Житлова ділянка`,
            AGRICULTURE_PLOT: `Сільськогосподарська ділянка`,
        },
    },
};
